var lbxMuthal = ["அ","ஆ","இ","ஈ","உ","ஊ","எ","ஏ","ஐ","ஒ","ஓ","ஔ","க","கா","கி","கீ","கு","கூ","கெ","கே","கை","கொ","கோ","கௌ","ங","ச","சா","சி","சீ","சு","சூ","செ","சே","சை","சொ","சோ","சௌ","ஞ","ஞா","ஞெ","ஞொ","த","தா","தி","தீ","து","தூ","தெ","தே","தை","தொ","தோ","தௌ","ந","நா","நி","நீ","நு","நூ","நெ","நே","நை","நொ","நோ","நௌ","ப","பா","பி","பீ","பு","பூ","பெ","பே","பை","பொ","போ","பௌ","ம","மா","மி","மீ","மு","மூ","மெ","மே","மை","மொ","மோ","மௌ","ய","யா","யு","யூ","யோ","யௌ","வ","வா","வி","வீ","வெ","வே","வை","வௌ"];

var lstWholeMey = ["க்","ங்","ச்","ஞ்","ட்","ண்","த்","ந்","ப்","ம்","ய்","ர்","ல்","வ்","ழ்","ள்","ற்","ன்"];

var lstMayankuMey = [];

var lbxEeru = ["க","கா","கி","கீ","கு","கூ","கே","கை","கோ","கௌ","ங","ஙா","ஙி","ஙீ","ஙு","ஙூ","ஙே","ஙை","ஙோ","ச","சா","சி","சீ","சு","சூ","சே","சை","சோ","ஞ்","ஞ","ஞா","ஞி","ஞீ","ஞு","ஞூ","ஞே","ஞை","ஞோ","ட","டா","டி","டீ","டு","டூ","டே","டை","டோ","ண்","ண","ணா","ணி","ணீ","ணு","ணூ","ணே","ணை","ணோ","த","தா","தி","தீ","து","தூ","தே","தை","தோ","ந்","ந","நா","நி","நீ","நு","நூ","நே","நை","நொ","நோ","ப","பா","பி","பீ","பு","பூ","பே","பை","போ","ம்","ம","மா","மி","மீ","மு","மூ","மே","மை","மோ","ய்","ய","யா","யி","யீ","யு","யூ","யே","யை","யோ","ர்","ர","ரா","ரி","ரீ","ரு","ரூ","ரே","ரை","ரோ","ல்","ல","லா","லி","லீ","லு","லூ","லே","லை","லோ","வ்","வ","வா","வி","வீ","வு","வூ","வே","வை","வோ","வௌ","ழ்","ழ","ழா","ழி","ழீ","ழு","ழூ","ழே","ழை","ழோ","ள்","ள","ளா","ளி","ளீ","ளு","ளூ","ளே","ளை","ளோ","ற","றா","றி","றீ","று","றூ","றே","றை","றோ","ன்","ன","னா","னி","னீ","னு","னூ","னே","னை","னோ"];

var lstMayankuMey = [];

function fill_lstMayankuMey(ninraMey)
{
	try
	{
		//lstMayankuMey.Items.Clear();

		//அ 	ஆ 	இ 	ஈ 	உ 	ஊ 	எ 	ஏ 	ஐ 	ஒ 	ஓ 	ஔ

		if (ninraMey == "ய்"//119
		   || ninraMey == "ர்"//119
		   || ninraMey == "ழ்"//119
		   )
		{
			lstMayankuMey.push(
				"க்","ங்","ச்","ஞ்","த்","ந்","ப்","ம்"
				);
		}
		//க் 	க 	கா 	கி 	கீ 	கு 	கூ 	கெ 	கே 	கை 	கொ 	கோ 	கௌ
		if (ninraMey == "க்" //110 & 118
			|| ninraMey == "ங்" //111
			|| ninraMey == "ட்" //113
			|| ninraMey == "ற்"//113
			|| ninraMey == "ண்"//114
			|| ninraMey == "ன்"//114

			|| ninraMey == "ய்"//116
			|| ninraMey == "ர்"//116
			|| ninraMey == "ழ்"//116

			|| ninraMey == "ல்"//117
			|| ninraMey == "ள்"//117
			)
		{
			lstMayankuMey.push(
				"க","கா","கி","கீ","கு","கூ","கெ","கே","கை","கொ","கோ","கௌ"
				);
		}
		//ங் 	ங 	ஙா 	ஙி 	ஙீ 	ஙு 	ஙூ 	ஙெ 	ஙே 	ஙை 	ஙொ 	ஙோ 	ஙௌ
		if (ninraMey == "ய்"//116
			|| ninraMey == "ர்"//116
			|| ninraMey == "ழ்"//116

			 || ninraMey == "ங்"//118
			)
		{
			lstMayankuMey.push(
				"ங"
				);				//,"ஙா","ஙி","ஙீ","ஙு","ஙூ","ஙெ","ஙே","ஙை","ஙொ","ஙோ","ஙௌ"				
		}
		//ச் 	ச 	சா 	சி 	சீ 	சு 	சூ 	செ 	சே 	சை 	சொ 	சோ 	சௌ
		if (ninraMey == "ச்" //110 & 118
			|| ninraMey == "ஞ்" //112
			|| ninraMey == "ட்" //113
			|| ninraMey == "ற்"//113
			|| ninraMey == "ண்"//114
			|| ninraMey == "ன்"//114

			|| ninraMey == "ய்"//116
			|| ninraMey == "ர்"//116
			|| ninraMey == "ழ்"//116

			 || ninraMey == "ல்"//117
			|| ninraMey == "ள்"//117
		)
		{
			lstMayankuMey.push(
				"ச","சா","சி","சீ","சு","சூ","செ","சே","சை","சொ","சோ","சௌ"
				);
		}
		//ஞ் 	ஞ 	ஞா 	ஞி 	ஞீ 	ஞு 	ஞூ 	ஞெ 	ஞே 	ஞை 	ஞொ 	ஞோ 	ஞௌ
		if (ninraMey == "ண்"//114
		|| ninraMey == "ன்"//114
			|| ninraMey == "ய்"//116
			|| ninraMey == "ர்"//116
			|| ninraMey == "ழ்"//116

			 || ninraMey == "ஞ்"//118
		)
		{
			if (ninraMey == "ய்"//116
			|| ninraMey == "ர்"//116
			|| ninraMey == "ழ்"//116
				)
			{
				lstMayankuMey.push(
				"ஞ","ஞா","ஞெ","ஞொ"
				);
			}
			else
			{
				lstMayankuMey.push(
				"ஞ","ஞா","ஞி","ஞீ","ஞு","ஞூ","ஞெ","ஞே","ஞை","ஞொ","ஞோ","ஞௌ"
				);
			}
		}
		//ட் 	ட 	டா 	டி 	டீ 	டு 	டூ 	டெ 	டே 	டை 	டொ 	டோ 	டௌ
		if (
		   ninraMey == "ண்"//114
			|| ninraMey == "ய்"//116
			|| ninraMey == "ர்"//116
			|| ninraMey == "ழ்"//116

			|| ninraMey == "ட்"//118
		   )
		{
			lstMayankuMey.push(
				"ட","டா","டி","டீ","டு","டூ","டெ","டே","டை","டொ","டோ","டௌ"
				);
		}
		//ண் 	ண 	ணா 	ணி 	ணீ 	ணு 	ணூ 	ணெ 	ணே 	ணை 	ணொ 	ணோ 	ணௌ
		if (
			ninraMey == "ய்"//116
			|| ninraMey == "ர்"//116
			|| ninraMey == "ழ்"//116

			|| ninraMey == "ண்"//118
			)
		{
			lstMayankuMey.push(
		"ண","ணா","ணி","ணீ","ணு","ணூ","ணெ","ணே","ணை","ணொ","ணோ","ணௌ"
		);
		}
		//த் 	த 	தா 	தி 	தீ 	து 	தூ 	தெ 	தே 	தை 	தொ 	தோ 	தௌ
		if (ninraMey == "த்"//110 
		|| ninraMey == "ந்"//112

			|| ninraMey == "ய்"//116
			|| ninraMey == "ர்"//116
			|| ninraMey == "ழ்"//116

			|| ninraMey == "த்"//118
		)
		{
			lstMayankuMey.push(
				"த","தா","தி","தீ","து","தூ","தெ","தே","தை","தொ","தோ","தௌ"
				);
		}
		//ந் 	ந 	நா 	நி 	நீ 	நு 	நூ 	நெ 	நே 	நை 	நொ 	நோ 	நௌ
		if (ninraMey == "ய்"//116
			|| ninraMey == "ர்"//116
			|| ninraMey == "ழ்"//116

			|| ninraMey == "ந்"//118
		)
		{
			lstMayankuMey.push(
				"ந","நா","நி","நீ","நு","நூ","நெ","நே","நை","நொ","நோ","நௌ"
				);
		}
		//ப் 	ப 	பா 	பி 	பீ 	பு 	பூ 	பெ 	பே 	பை 	பொ 	போ 	பௌ
		if (ninraMey == "ப்" //110 & 118
			|| ninraMey == "ட்" //113
			|| ninraMey == "ற்"//113
			|| ninraMey == "ண்"//114
			|| ninraMey == "ன்"//114
			|| ninraMey == "ம்"//115

			|| ninraMey == "ய்"//116
			|| ninraMey == "ர்"//116
			|| ninraMey == "ழ்"//116

			|| ninraMey == "ல்"//117
			|| ninraMey == "ள்"//117


		)
		{
			lstMayankuMey.push(
				"ப","பா","பி","பீ","பு","பூ","பெ","பே","பை","பொ","போ","பௌ"
				);
		}
		//ம் 	ம 	மா 	மி 	மீ 	மு 	மூ 	மெ 	மே 	மை 	மொ 	மோ 	மௌ
		if (ninraMey == "ண்"//114
			|| ninraMey == "ன்"//114

			|| ninraMey == "ய்"//116
			|| ninraMey == "ர்"//116
			|| ninraMey == "ழ்"//116

			|| ninraMey == "ம்"//118
			)
		{
			lstMayankuMey.push(
				"ம","மா","மி","மீ","மு","மூ","மெ","மே","மை","மொ","மோ","மௌ"
				);
		}
		//ய் 	ய 	யா 	யி 	யீ 	யு 	யூ 	யெ 	யே 	யை 	யொ 	யோ 	யௌ
		if (ninraMey == "வ்"//111
		   || ninraMey == "ஞ்" //112
		   || ninraMey == "ந்"//112
		   || ninraMey == "ண்"//114
		   || ninraMey == "ன்"//114
		   || ninraMey == "ம்"//115

			|| ninraMey == "ய்"//116 & 118
			|| ninraMey == "ர்"//116
			|| ninraMey == "ழ்"//116

			 || ninraMey == "ல்"//117
			|| ninraMey == "ள்"//117
		   )
		{

			if (ninraMey == "ய்"//116
			|| ninraMey == "ர்"//116
			|| ninraMey == "ழ்"//116
				)
			{
				lstMayankuMey.push(
				"ய","யா","யு","யூ","யோ","யௌ"
				);
			}
			else
			{
				lstMayankuMey.push(
				"ய","யா","யி","யீ","யு","யூ","யெ","யே","யை","யொ","யோ","யௌ"
				);
			}
		}
		//ர் 	ர 	ரா 	ரி 	ரீ 	ரு 	ரூ 	ரெ 	ரே 	ரை 	ரொ 	ரோ 	ரௌ
		//ல் 	ல 	லா 	லி 	லீ 	லு 	லூ 	லெ 	லே 	லை 	லொ 	லோ 	லௌ
		if (
			   ninraMey == "ல்"//118
		   )
		{
			lstMayankuMey.push(
				"ல","லா","லி","லீ","லு","லூ","லெ","லே","லை","லொ","லோ","லௌ"
				);
		}
		//வ் 	வ 	வா 	வி 	வீ 	வு 	வூ 	வெ 	வே 	வை 	வொ 	வோ 	வௌ
		if (
			ninraMey == "ண்"//114
			|| ninraMey == "ன்"//114
			|| ninraMey == "ம்"//115

			|| ninraMey == "ய்"//116
			|| ninraMey == "ர்"//116
			|| ninraMey == "ழ்"//116

			|| ninraMey == "ல்"//117
			|| ninraMey == "ள்"//117

			|| ninraMey == "வ்"//118
			)
		{
			if (ninraMey == "ய்"//116
			|| ninraMey == "ர்"//116
			|| ninraMey == "ழ்"//116
				)
			{
				lstMayankuMey.push(
				"வ","வா","வி","வீ","வெ","வே","வை","வௌ"
				);
			}
			else
			{
				lstMayankuMey.push(
				"வ","வா","வி","வீ","வு","வூ","வெ","வே","வை","வொ","வோ","வௌ"
				);
			}
		}
		//ழ் 	ழ 	ழா 	ழி 	ழீ 	ழு 	ழூ 	ழெ 	ழே 	ழை 	ழொ 	ழோ 	ழௌ
		//ள் 	ள 	ளா 	ளி 	ளீ 	ளு 	ளூ 	ளெ 	ளே 	ளை 	ளொ 	ளோ 	ளௌ
		if (
			   ninraMey == "ள்"//118
		   )
		{
			lstMayankuMey.push(
				"ள","ளா","ளி","ளீ","ளு","ளூ","ளெ","ளே","ளை","ளொ","ளோ","ளௌ"
				);
		}
		//ற் 	ற 	றா 	றி 	றீ 	று 	றூ 	றெ 	றே 	றை 	றொ 	றோ 	றௌ
		if (
		  ninraMey == "ன்"//114
		   || ninraMey == "ற்"//118
		  )
		{
			lstMayankuMey.push(
				"ற","றா","றி","றீ","று","றூ","றெ","றே","றை","றொ","றோ","றௌ"
				);
		}
		//ன் 	ன 	னா 	னி 	னீ 	னு 	னூ 	னெ 	னே 	னை 	னொ 	னோ 	னௌ
		if (
		  ninraMey == "ன்"//118                  
		  )
		{
			lstMayankuMey.push(
				"ன","னா","னி","னீ","னு","னூ","னெ","னே","னை","னொ","னோ","னௌ"
				);
		}

		console.log("016794168003PM: End.");
	}
	catch (ex)
	{
		console.log("020747977003PM: " + ex.message);
	}
	finally
	{
		console.log("071794168003PM: End.");
	}
}
